enide-electronics/growatt-sph-spa-esp8266/src/WifiAndConfigManager.h
/*
  WifiAndConfigManager.h - Library header for the ESP8266/ESP32 Arduino platform
  SPIFFS based configuration

  Written by JF enide.electronics (at) enide.net
  Licensed under GNU GPLv3
*/

#ifndef WIFI_AND_CONFIG_MANAGER_H
#define WIFI_AND_CONFIG_MANAGER_H

#include <ESP8266WiFi.h>
#include <WiFiManager.h>
#include <ArduinoJson.h>


class WifiAndConfigManager {
    private:
        WiFiManager wm;
        
        WiFiManagerParameter *deviceNameParam;
        WiFiManagerParameter *softApPasswordParam;
        WiFiManagerParameter *mqttServerParam;
        WiFiManagerParameter *mqttPortParam;
        WiFiManagerParameter *mqttUsernameParam;
        WiFiManagerParameter *mqttPasswordParam;
        WiFiManagerParameter *mqttBaseTopicParam;
        WiFiManagerParameter *modbusAddressParam;
        WiFiManagerParameter *modbusPollingInSecondsParam;
        
        char inverterModelCustomFieldBufferStr[700];
        WiFiManagerParameter *inverterModelCustomFieldParam;
        WiFiManagerParameter *inverterTypeCustomHidden;
        
        String deviceName;
        String softApPassword;
        String mqttServer;
        int mqttPort;
        String mqttUsername;
        String mqttPassword;
        String mqttBaseTopic;
        int modbusAddress;
        int modbusPollingInSeconds;
        String inverterType;
        
        bool saveRequired;
        bool rebootRequired;
        bool wifiConnected;
        
        void load();
        void save();
        void copyFromParamsToVars();
        void show();
        void saveConfigCallback();
        void handleEraseAll();
        String getParam(String name);
        void _updateInverterTypeSelect();

    public:
        WifiAndConfigManager();

        void setupWifiAndConfig();

        String getDeviceName();
        String getMqttServer();
        int getMqttPort();
        String getMqttUsername();
        String getMqttPassword();
        String getMqttTopic();
        int getModbusAddress();
        int getModbusPollingInSeconds();
        String getInverterType();

        WiFiManager & getWM();
        
        bool checkforConfigChanges();
        bool isRestartRequired();
        bool isWifiConnected();
};

#endif
